# Напишите функцию, которая принимает строку и возвращает ту же строку, в которой все символы 
# с четными индексами в каждом слове написаны заглавными буквами, а все символы с нечетными индексами — строчными. 
# Индексация, описанная выше, начинается с нуля, поэтому нулевой индекс — четный, следовательно, 
# этот символ должен быть заглавным. Индексация сбрасывается для каждого слова . Другими словами, 
# первая буква каждого слова имеет четный индекс 0, поэтому она всегда должна быть заглавной и т.д.

# Переданная строка будет состоять только из букв и пробелов ( ' '). Пробелы будут присутствовать 
# только в том случае, если слов несколько. Слова будут разделены одним пробелом ( ' ').

# Примеры:
# "String" => "StRiNg"
# "Weird string case" => "WeIrD StRiNg CaSe"