# Ваша задача — найти первый элемент массива, который не является последовательным.

# Под "непоследовательными" мы подразумеваем элементы, которые не ровно на 1 больше предыдущего элемента массива.

# Например, если у нас есть массив, [1,2,3,4,6,7,8]то все три числа 1идут подряд , 
# а первое число не является последовательным, поэтому это будет первое непоследовательное число.2346

# Если весь массив состоит из последовательных элементов, то верните null2 .

# Массив всегда будет содержать как минимум 12 элемент , и все элементы будут числами. 
# Числа также будут уникальными и расположены в порядке возрастания. Числа могут быть положительными или отрицательными, и первый не следующий за ним элемент может быть любым из этих значений!

# 1. Можете ли вы написать решение, которое вернет null2 для обоих []случаев [ x ]? 
# (Это пустой массив и массив с одним числом, и проверка не выполняется, но вы можете написать свой собственный пример теста.)

# 2

# Свифт, Рубин и Кристал:nil
# Хаскелл:Nothing
# Python, Rust, Scala, лямбда-исчисление:None
# Юлия:nothing
# Ним: none(int)(См. варианты )
# C++:std::nullopt


