# Лягушка с широким ртом проявляет особый интерес 
# к пищевым привычкам других существ.

# Он никак не может перестать спрашивать встречающихся 
# ему существ, чем они любят питаться. Но потом 
# он встречает аллигатора, который просто ОБОЖАЕТ 
# есть лягушек с широкими пастями!

# Когда он встречает аллигатора, тот вытягивает крошечный рот.

# Ваша цель в этом задании — создать и завершить 
# mouth_sizeметод, который принимает один аргумент 
# animal, соответствующий животному, встреченному 
# лягушкой. Если это животное alligator(регистронезависимое), 
# верните значение, smallв противном случае верните значение wide.


def mouth_size(animal): 
    pass

